# Question 71 - Employee tenure

Below is a snippet from a table that contains information about employees that work at Company XYZ:
```
employee_name 	employee_id 	date_joined 	age 	yrs_of_experience
Andy 	123456 	2015-02-15 	45 	24
Beth 	789456 	2014-02-15 	36 	15
Cindy 	654123 	2017-05-16 	34 	14
Dale 	963852 	2018-01-15 	25 	4
```

Company XYZ is looking to create a report that tracks the tenure of its employees. Using Python, write a snippet to add a column with each individual's years of experience. You can assume the current date is January 1st, 2019. All records in the table are shown in YYYY-MM-DD format.

In [1]:
import pandas as pd
import numpy as np 

df = pd.DataFrame(
    [
        ['andy',123,'2015-02-15',45,24],
        ['beth',456,'2014-02-15',36,15],
        ['cindy',789,'2017-06-15',34,14]
    ],
    columns=['name','id','date','age','xp']
)
df

    name   id        date  age  xp
0   andy  123  2015-02-15   45  24
1   beth  456  2014-02-15   36  15
2  cindy  789  2017-06-15   34  14

In [2]:
df['tenure_years'] = (pd.datetime.now().date() - pd.to_datetime(df['date']).dt.date) / np.timedelta64(1,'Y') 
df

    name   id        date  age  xp  tenure_years
0   andy  123  2015-02-15   45  24      4.481954
1   beth  456  2014-02-15   36  15      5.481290
2  cindy  789  2017-06-15   34  14      2.151995